app/views/collaborators/_collaborators_form.html.erb

        <%= f.label :collaborators %>
        <%= f.select :user, options_from_collection_for_select(User.all, "id", "email") %>
---
SELECT "users".* FROM "users"

      <% end %>
      <% if @wiki.users.any? %>
---
SELECT  1 AS one FROM "users" INNER JOIN "collaborators" ON "users"."id" = "collaborators"."user_id" WHERE "collaborators"."wiki_id" = ? LIMIT ?  [["wiki_id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "collaborators" ON "users"."id" = "collaborators"."user_id" WHERE "collaborators"."wiki_id" = ?  [["wiki_id", 56]]