app/controllers/charges_controller.rb

UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", 0], ["updated_at", "2017-10-24 20:36:59.300187"], ["id", 12]]
---
  def create
    # Creates a Stripe Customer object, for associating
    # with the charge
    customer = Stripe::Customer.create(
      email: current_user.email,
      card: params[:stripeToken]
    )

    # Where the real magic happens
    charge = Stripe::Charge.create(
      customer: customer.id, # Note -- this is NOT the user_id in your app
      amount: Amount.default,
      description: "BigMoney Membership - #{current_user.email}",
      currency: 'usd'
    )

    current_user.update(role: :premium)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", 0], ["updated_at", "2017-10-24 22:40:33.607491"], ["id", 12]]
SELECT "wikis".* FROM "wikis" WHERE "wikis"."user_id" = ?  [["user_id", 6]]
UPDATE "wikis" SET "private" = ?, "updated_at" = ? WHERE "wikis"."id" = ?  [["private", "f"], ["updated_at", "2017-10-26 21:08:15.343002"], ["id", 51]]
---
  def edit
    @user = User.find(params[:id])
    @user.update(role: :standard)

    # convert downgrading user's wikis to public
    @user.wikis.each do |wiki|
      wiki.private = false
      wiki.save!