app/controllers/collaborators_controller.rb

  def create
    user = User.find(params[:collaborator][:user])
    @wiki = Wiki.find(params[:wiki_id])
    if @wiki.users.include?(user)
      flash[:alert] = "#{user.email} has already been added as a collaborator"
      redirect_to edit_wiki_path(@wiki)
    else
      if Collaborator.create(user_id: user.id, wiki_id: @wiki.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "collaborators" ON "users"."id" = "collaborators"."user_id" WHERE "collaborators"."wiki_id" = ? AND "users"."id" = ? LIMIT ?  [["wiki_id", 56], ["id", 7], ["LIMIT", 1]]
INSERT INTO "collaborators" ("user_id", "wiki_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 7], ["wiki_id", 56], ["created_at", "2017-10-27 01:10:34.651137"], ["updated_at", "2017-10-27 01:10:34.651137"]]

  def destroy
    user = User.find(params[:user_id])
    @wiki = Wiki.find(params[:wiki_id])
    collaborator = Collaborator.find_by(params[:user_id])
    if collaborator.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT ?  [["id", 54], ["LIMIT", 1]]
SELECT  "collaborators".* FROM "collaborators" WHERE (3) LIMIT ?  [["LIMIT", 1]]
DELETE FROM "collaborators" WHERE "collaborators"."id" = ?  [["id", 1]]