app/controllers/wikis_controller.rb

SELECT "wikis".* FROM "wikis" WHERE "wikis"."private" = ?  [["private", "f"]]
SELECT "wikis".* FROM "wikis"
---
  def index
    if current_user.standard?
      @wikis = Wiki.where(private: false)
    else
      @wikis = Wiki.all

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? ORDER BY rank DESC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
 def show
   @wiki = Wiki.find(params[:id])

INSERT INTO "wikis" ("title", "body", "private", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "adasd"], ["body", "sdasdasdasdasd"], ["private", "t"], ["user_id", 6], ["created_at", "2017-10-25 01:35:38.580055"], ["updated_at", "2017-10-25 01:35:38.580055"]]
---
 def create
   @wiki = current_user.wikis.build(wiki_params)
   @wiki.user = current_user

   if @wiki.save

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
 def edit
   @wiki = Wiki.find(params[:id])

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "wikis" SET "body" = ?, "updated_at" = ? WHERE "wikis"."id" = ?  [["body", "test 4 test 4 test 4"], ["updated_at", "2017-10-03 21:37:54.407468"], ["id", 4]]
---
 def update
   @wiki = Wiki.find(params[:id])
   @wiki.assign_attributes(wiki_params)

   if @wiki.save

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "wikis" WHERE "wikis"."id" = ?  [["id", 3]]
---
 def destroy
   @wiki = Wiki.find(params[:id])

# #8
   if @wiki.destroy